In [9]:
import pandas as pd

In [11]:
df = pd.read_csv('../data/salaries.csv')

In [12]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [14]:
df[['Salary', 'Name']]

   Salary    Name
0   50000    John
1  120000   Sally
2   80000  Alyssa

In [15]:

df['Salary'].max()

120000

In [16]:

df['Salary'] > 60000

0    False
1     True
2     True
Name: Salary, dtype: bool

In [17]:
df[df['Salary'] > 60000]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27

In [18]:
df.as_matrix()

/Users/Slimn/anaconda3/envs/tfdl/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.

array([['John', 50000, 34],
       ['Sally', 120000, 45],
       ['Alyssa', 80000, 27]], dtype=object)